CSI API ETABS v1
cLineElm Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cLineElm
Public Interface cLineElm
Dim instance As cLineElm
public interface class cLineElm
type cLineElm =  interface end
The cLineElm type exposes the following members.
Methods
Name | Description
Count
GetEndLengthOffset
GetInsertionPoint
GetLoadDistributed
GetLoadPoint
GetLoadTemperature
GetLocalAxes
GetMaterialOverwrite
GetModifiers
GetNameList
GetObj
GetPoints
GetProperty
GetReleases
GetTCLimits
GetTransformationMatrix
Top
See Also
Reference
ETABSv1 Namespace